/**
 * ES6的创造这加强了字符串与正则表达式,为它们添加了新的能力,并补充了一些长期
 * 缺失的功能.
 * 1.更好的 Unicode 支持
 *   1.1 UTF-16代码点
 *   1.2 codePointAt()方法
 *   1.3 String.fromCodePoint()方法
 *   1.4 normalize()方法
 *   1.5 正则表达式 u 标志
 *       1.5.1 u标志如何运作
 *       1.5.2 计算代码点数量
 *       1.5.3 判断是否支持 u 标志
 * 2.字符串的其他改动
 *   2.1识别子字符串的方法
 *   2.2repeat()方法
 * 3.正则表达式的其他改动
 *   3.1正则表达式y标志
 *   3.2复制正则表达式
 *   3.3flags属性
 * 4.模板字面量
 *   4.1基本语法
 *   4.2多行字符串
 *      4.2.1 ES6之前的权宜之计
 *      4.2.2 多行字符串的简单解决方法
 *   4.3制造替换位
 *   4.3标签化模板
 *      4.3.1 定义标签
 *      4.3.2 使用模板字面量的原始值
 * 总结
 */

