/**
 * 1.带参数默认值的函数
 *   1.1在ES5中模拟参数默认值
 *   1.2ES6中的参数默认值
 *   1.3参数默认值如何影响 arguments 对象
 *   1.4参数默认值表达式
 *   1.5参数默认值的暂时性死区
 * 2.使用不具名参数
 *   2.1ES5中的不具名参数
 *   2.2剩余参数
 *      2.2.1剩余参数的限制条件
 *      2.2.2剩余参数如何影响 arguments 对象
 * 3.函数构造器的增强能力
 * 4.扩展运算符
 * 5.ES6的名称属性
 *   5.1选择合适的名称
 *   5.2名称属性的特殊情况
 * 6.明确函数的双重用途
 *   6.1在ES5中判断函数如何被调用
 *   6.2new.target元属性
 * 7.块级函数
 *   7.1决定何时使用块级函数
 *   7.2非严格模式的块级函数
 * 8.箭头函数
 *   8.1箭头函数语法
 *   8.2创建立即调用函数表达式
 *   8.3没有this绑定
 *   8.4箭头函数与数组
 *   8.5没有arguments绑定
 *   8.6识别箭头函数
 * 9.尾调用优化
 *   9.1有何不同?
 *   9.2如何控制尾调用优化
 * 10.总结
 */