/**
 * 1.创建数组
 *   1.1 Array.of()方法
 *   1.2 Array.from()方法
 *       1.2.1 映射转换
 *       1.2.2 在可迭代对象上使用
 * 2.所有数组上的新方法
 *   2.1 find() 与 findIndex() 方法
 *   2.2 fill() 方法
 *   2.3 copyWithin() 方法
 * 3.类型化数组
 *   3.1 数值数据类型
 *   3.2 数组缓冲区
 *   3.3 使用视图操作数组缓冲区
 *       3.3.1 获取视图信息
 *       3.3.2 读取与写入数据
 *       3.3.3 类型化数组即为视图
 *       3.3.4 创建特定类型视图
 * 4.类型化数组与常规数组的相似点
 *   4.1 公共方法
 *   4.2 相同的迭代器
 *   4.3 of() 与 from() 方法
 * 5.类型化数组与常规数组的区别
 *   5.1 行为差异
 *   5.2 遗漏的方法
 *   5.3 附加的方法
 * 6.总结
 */